// 表の動的作成
function makeTable(data, tableId) {
	// 表の作成開始
	var rows = [];
	var table = document.createElement("table");

	// 表に2次元配列の要素を格納
	for (i = 0; i < data.length; i++) {
		rows.push(table.insertRow(-1)); // 行の追加
		for (j = 0; j < data[0].length; j++) {
			cell = rows[i].insertCell(-1);
			cell.innerHTML = data[i][j];
			// 背景色の設定
			if (i == 0) {
				cell.style.backgroundColor = "#bbb"; // ヘッダ行
			} else {
				cell.style.backgroundColor = "#ddd"; // ヘッダ行以外
			}
			if (j == 0) {
				cell.classList.add('galar');
			}
		}
	}
	// 指定したdiv要素に表を加える
	document.getElementById(tableId).appendChild(table);
}
window.onload = function () {
	// 表のデータ
	var data = [
		/*地名*/
		["GALAJ", "推測", "コメント", "分類"],
		["GALAJ", "GALAR", "ガラル", "地名"],
		["CFSR", "", "ハロンタウン", "地名"],
		["XHEDDY", "BRASSY", "ブラッシータウン", "地名"],
		["KOYXOH", "ENGINE", "エンジンシティ <br> Eに当たる文字が違うのは、 <br>アラビア語等に見られる語頭形・語尾形か", "地名"],
		["VUDF", "TURF", "ターフタウン", "地名"],
		["WCA", "BOW", "バウタウン <br>Bowは船首の意", "地名"],
		["MDEBCFA", "KNUCKLE", "ナックルシティ <br>Knuckleは関節の意", "地名"],
		["TRNBOK", "", "ラテラルタウン", "地名"],
		["LYEXA", "あらべすく(仮名) <br>ARBSQ(TDN)", "アラベスクタウン <br>アラベスクは英語で「アラビアの」という意 <br>アラビア語は子音だけを書くアブジャド", "地名"],
		["KHMTOR", "CIRCUS(羅)", "キルクスタウン <br>戦車競技場", "地名"],
		["WSILYJ", "", "スパイクタウン", "地名"],
		["AECIIJT", "", "シュートシティ", "地名"],
    ["", "", "", ""],
    ["", "", "", ""],
    ["", "", "", ""],

		/*ユニフォーム*/
    ["SeeC chqllingi", "SEED Challenge", "チャレンジセット", "ユニフォーム"],
    ["WCSh", "KUSA", "くさセット", "ユニフォーム"],
    ["BKSe", "MIZU", "みずセット", "ユニフォーム"],
    ["IOWO", "HONO", "ほのおセット", "ユニフォーム"],
    ["OCET", "", "ゴーストセット", "ユニフォーム"],
    ["RFESBLO", "KAKUTOU", "かくとうセット", "ユニフォーム"],
    ["EHIOT", "FAIRY", "フェアリーセット", "ユニフォーム"],
    ["TMY", "IWA", "いわセット", "ユニフォーム"],
    ["BDeY", "", "こおりセット", "ユニフォーム"],
    ["JWE", "AKU", "あくセット", "ユニフォーム"],
    ["MLKDUA", "DRAGON", "ドラゴンセット", "ユニフォーム"],
    ["CVSLI", "", "むしセット", "ユニフォーム"],
    ["CYDYUH", "HAGANE", "はがねセット", "ユニフォーム"],
    ["IEOeU", "PSICO(伊)", "エスパーセット", "ユニフォーム"],
    ["UEXMF", "DENKI", "でんきセット", "ユニフォーム"],
    ["LFCBN", "JIMEN", "じめんセット", "ユニフォーム"],
    ["XFRUK", "HIKOU", "ひこうセット", "ユニフォーム"],
    ["XUTXVF", "NORMAL", "ノーマルセット", "ユニフォーム"],
    ["JNHV", "DOKU", "どくセット", "ユニフォーム"],
    ["Whodplon", "Champion", "チャンピオンセット", "ユニフォーム"],
    ["", "", "", ""],
    ["", "", "", ""],
    ["", "", "", ""],

    /*キャラクター*/
    ["ROSE", "ROSE", "ローズ", "人名"],
    ["DCVDB", "DANDE", "ダンデ", "人名"],
    ["EOU", "HOP", "ホップ", "人名"],
    ["MVRY", "MARY", "マリィ", "人名"],
    ["OeeJ", "BEET", "ビート", "人名"],
    ["LJOOAW", "YALLOW", "ヤロー", "人名"],
    ["UVUK", "", "ルリナ", "人名"],
    ["RVDS", "KABU", "カブ", "人名"],
    ["SVFJU", "", "サイトウ", "人名"],
    ["CeICe", "ONION", "オニオン", "人名"],
    ["", "POPLAR", "ポプラ", "人名"],
    ["NBRVBY", "MAKUWA", "マクワ", "人名"],
    ["WHKOV", "MELON", "メロン", "人名"],
    ["", "", "ネズ", "人名"],
    ["JUIeOB", "", "キバナ", "人名"],
    ["BhLLCli", "BALLGuy", "ボールガイ", "人名"],
    ["EKDWVS", "", "バーダン", "人名"],
    ["", "", "", ""],
    ["", "", "", ""],
    ["", "", "", ""],

		/*会社名*/
    ["QCREIS", "POKJOB", "ポケジョブ", "会社名"],
    ["MVKTO COENOE", "MACRO COSMOS", "マクロコスモス社 <br>MとCが合わないのは語頭・語中形だからか <br>会社名だから遊び心でもじったのか", "会社名"],
    ["Rorofin", "Railway", "マクロコスモス・レールウェイズ <br>赤色", "会社名"],
    ["Kaqhdhga", "", "マクロコスモス・コンストラクション <br>灰色", "会社名"],
    ["Dofk", "Bank", "マクロコスモス・バンク <br>緑色", "会社名"],
    ["Jfodiqk", "", "マクロコスモス・<br>黄色<br>(英)MacroCosmosMedia", "会社名"],
    ["", "", "マクロコスモス・テクノロジー <br>黄緑色<br>(英)MacroCosmosTech", "会社名"],
    ["Tafi", "", "マクロコスモス・ライフ <br>ピンク", "会社名"],
    ["", "", "マクロコスモス・エネルギー <br>オレンジ", "会社名"],
    ["", "", "マクロコスモス・エアラインズ <br>青色", "会社名"],
    ["MCR", "MCR", "MCR貨物", "会社名"],
    ["", "", "マクロネット", "会社名"],
    ["MC qtlhn", "", "MC証券", "会社名"],
    ["MC rcuaf", "", "MC生命<br>オニオンのジムのスポンサー", "会社名"],
    ["Lgrdn fkacr", "", "ターフジムのスポンサー <br>ヒメンカの絵柄", "会社名"],
    ["Mdrgqdif", "", "エンジンジムのスポンサー <br>カブさんが描かれてる", "会社名"],
    ["LIr", "", "エンジンジムのスポンサー <br>上のポスターの左上にあった", "会社名"],
    ["Clmkin", "", "アラベスクジムのスポンサー <br>香水", "会社名"],
    ["DMBRUX ITKCN", "", "ナックルジムのスポンサー <br>プロテインみたいなやつ", "会社名"],
    ["Ricg qnmq", "", "オニオンのジムのスポンサー <br>カメラ/レドームシ", "会社名"],
    ["Lmdt qW", "", "チャンピオンリーグ？のスポンサー", "会社名"],
    ["IKVqorNor", "", "テレビマクロ<br>(英)Macro Cosmos Television", "会社名"],
    ["AUXWEOY", "", "チャンピオンリーグ？のスポンサー <br>プーマみたいなやつ", "会社名"],
    ["lfdqlfd", "エイト O エイト", "エイトオーエイト<br>きのみショップ<br>(英)Grow Sures", "会社名"],
    ["WeUTCEKV", "BOUTIQUE(仏)", "ブティック(仏)", "会社名"],
    ["BOEXIH YFF", "INN", "スボミーイン<br>英Budew", "会社名"],
    ["KSDEV iaLLl", "caffe(伊)", "ヨシダ珈琲", "会社名"],
    ["Vdrthom Rcdor", "", "グラモフォンレコード", "会社名"],
    ["Edial", "", "ガラル郵便<br>ポストの下の黒い文字", "会社名"],
    ["Nhgaidomrq", "", "美容院", "会社名"],
    ["OeeWNEER", "BOOKMAAK", "ブックマーク", "会社名"],
    ["Ciko", "", "なみのり運輸<br>(英)Surf Shipping", "会社名"],
    ["AEUReY", "", "なみのり運輸<br>下の文字", "会社名"],
    ["Rrnh", "", "ラプラス造船<br>(英)Lapras Shipwrights", "会社名"],
    ["OEVSTIL", "", "ラプラス造船<br>下の文字", "会社名"],
    ["FYWEROBBKI", "", "ガラル消防署", "会社名"],
    ["WeeFO WOin", "", "ドッコラー土木", "会社名"],
    ["VUDF OWIN", "TURF FARM", "ターフ農園", "会社名"],
    ["EHHLCCU OWS", "SEEFOOD BAR", "レストラン防波亭", "会社名"],
    ["RoralAdci", "", "ホエルオー水産<br>(英)Wailord Aquaculture", "会社名"],
    ["SqH iqTTqR", "JET SETTER", "ジェットセッター", "会社名"],
    ["Rod Aion", "", "ドント ブリスター", "会社名"],
    ["ULCL", "フオグオ(仮名)", "レストラン フオグオ", "会社名"],
    ["DFDDOBI", "", "ペリッパー便", "会社名"],
    ["", "", "ボルチーニ", "会社名"],
    ["OKBKeCOC", "", "ステーキハウス<br>(英)Bob's Your Uncle", "会社名"],
    ["Edial laidE", "Ιωνια(古希)", "ホテル イオニア", "会社名"],
    ["GALAJ WNeY", "", "ガラル鉱産", "会社名"],
    ["ILNESTA", "", "テレスクリーン", "会社名"],
    ["Ricgqn Dfkaq", "", "シュートシティの広告 <br>ルリナのやつ", "会社名"],
    ["OXVX M YCHHR", "", "(英)Mach Motors<br>車のシンボル的なやつ", "会社名"],
    ["Edial", "", "シュートシティの広告", "会社名"],
    ["earig Dqh Edial", "", "シュートシティの広告<br>上のと同じとこ", "会社名"],
    ["Acdln Adoqnahln", "", "デイリーディスカバリー<br>ウールーのやつ。服のメーカー", "会社名"],
    ["Ogdqr", "", "シュートシティの広告<br>眼鏡の広告<br>(英)DEFOG", "会社名"],
    ["Ucidkao", "", "シュートシティの広告", "会社名"],
    ["Nmqol", "", "シュートシティの広告 <br>ホシガリス", "会社名"],
    ["JCYU RONe", "", "ロンド ロゼ", "会社名"],
    ["VEU", "", "シュートシティの駅広告<br>電池？", "会社名"],
    ["OKJI", "", "シュートシティの駅広告<br>電池の右下<br>KとIが逆向いてる......", "会社名"],
    ["CAEF", "", "シュートシティの駅広告 <br>歯", "会社名"],
    ["DTUTOEF", "", "シュートモノレール", "会社名"],
    ["CAEF", "", "シュートシティの駅広告 <br>アイス", "会社名"],
    ["BEFKUT SEVe", "", "ハガネール車両", "会社名"],
    ["", "", "アウローラ", "会社名"],
    ["SFAFWF OWE", "HIJIKI OKA", "ヒジキ オカ", "会社名"],
    ["WSILYJWCRVe", "", "スパイク商工会", "会社名"],
    ["", "", "イチバン", "会社名"],
    ["", "", "ガラル警察署", "会社名"],
    ["AJOS Lgroc", "YUME", "ゆめ牧場", "会社名"],
    ["Nhgaidomrq", "", "シュートシティの広告", "会社名"],
    ["GM", "", "ガラルタクシー", "会社名"],
    ["eLM", "", "バンバドロ", "会社名"],
    ["Vaoq Vldo", "", "服のメーカー", "会社名"],
    ["ORAWS", "", "モノレール駅のケーキ？の広告", "会社名"],
    ["FCYU Vkilr", "", "ロンドフラワーズ", "会社名"],
    ["M U", "", "ナックルユニバーシティ", "会社名"],
    ["WTESHUE ESFJCK", "", "アルセウス製薬<br>arceus", "会社名"],
    ["Fmc", "", "ラス<br>服のメーカー", "会社名"],
    ["AUXWEOY", "", "デンソク<br>プーマみたいなやつ", "会社名"],
    ["VaoqVldo", "", "キルクスジムのスポンサー", "会社名"],
    ["Ofkcrn ikdl", "", "バウジムのスポンサー", "会社名"],
    ["hJieA", "", "(英)Celebrity<br>ダイヤみたいなロゴ", "会社名"],
    ["Ofkcrn ikdl", "", "バウジムのスポンサー<br>おいしい水", "会社名"],
    ["Agfrlk", "", "キルクスジムのスポンサー", "会社名"],
    ["", "", "", "会社名"],
    ["", "", "", "会社名"],
    ["", "", "", "会社名"],
		/*文章*/
    ["", "", "", ""],
		/*スタジアム*/
    ["", "", "", ""],
		/*駅*/
    ["", "", "", ""],
		/*その他*/
    ["", "", "", ""],

	];

	// 表の動的作成
	makeTable(data, "table");
};
